tap "aquasecurity/trivy"
tap "azure/azd"
tap "azure/functions"
tap "azure/kubelogin"
tap "hashicorp/tap"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "sst/tap"
# New file format for still image compression
brew "jpeg-xl"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# .NET Core
brew "dotnet"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Postgres C API library
brew "libpq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Access large language models from the command-line
brew "llm"
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Data loading tool for PostgreSQL
brew "pgloader"
# Object-relational database system
brew "postgresql@18"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Convert HTML to PDF
brew "weasyprint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# Azure Developer CLI
brew "azure/azd/azd"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Consul
brew "hashicorp/tap/consul"
# Terraform
brew "hashicorp/tap/terraform"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Utility to add Dynamic Island like features to notch area
cask "alcove"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# AI chat client
cask "boltai"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Screen capturing tool
cask "cleanshot"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# AI-powered database and data management tool
cask "conar"
# Disk space visualiser
cask "daisydisk"
# Database version management tool
cask "dbngin"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Monitor resolution and settings manager
cask "displaybuddy"
# Calendar software
cask "fantastical"
# Per-application volume mixer, equalizer, and audio router
cask "finetune"
cask "font-cascadia-code-pl"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-source-code-pro"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Powerful macOS automation tool for window and system scripting
cask "hammerspoon"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Utility that shows the latest app updates
cask "latest"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# GUI app and toolkit for Claude Code
cask "opcode"
# LLM server built on MLX
cask "osaurus"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# To-do list
cask "todoist-app"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Indoor cycling game
cask "zwift"
vscode "anthropic.claude-code"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-ai"
vscode "ms-toolsai.vscode-ai-remote"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "rangav.vscode-thunder-client"
vscode "tamasfe.even-better-toml"
vscode "wayou.vscode-todo-highlight"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
uv "alembic"
uv "hypercorn"
uv "locust"
uv "magika"
uv "notebook"
uv "pyrefly"
uv "ruff"
uv "ty"
